espressif/esp-idf/components/soc/esp32c6/include/soc/hinf_reg.h
/** HINF_CFG_UPDATE_REG register
 *  update sdio configurations
 */
#define HINF_CFG_UPDATE_REG (DR_REG_HINF_BASE + 0xc)
/** HINF_CONF_UPDATE : WT; bitpos: [0]; default: 0;
 *  update the timing configurations
 */
#define HINF_CONF_UPDATE    (BIT(0))
#define HINF_CONF_UPDATE_M  (HINF_CONF_UPDATE_V << HINF_CONF_UPDATE_S)
#define HINF_CONF_UPDATE_V  0x00000001U
#define HINF_CONF_UPDATE_S  0

/** HINF_CFG_DATA7_REG register
 *  SDIO configuration register
 */
#define HINF_CFG_DATA7_REG (DR_REG_HINF_BASE + 0x1c)
/** HINF_PIN_STATE : R/W; bitpos: [7:0]; default: 0;
 *  configure cis addr 318 and 574
 */
#define HINF_PIN_STATE    0x000000FFU
#define HINF_PIN_STATE_M  (HINF_PIN_STATE_V << HINF_PIN_STATE_S)
#define HINF_PIN_STATE_V  0x000000FFU
#define HINF_PIN_STATE_S  0
/** HINF_CHIP_STATE : R/W; bitpos: [15:8]; default: 0;
 *  configure cis addr 312, 315, 568 and 571
 */
#define HINF_CHIP_STATE    0x000000FFU
#define HINF_CHIP_STATE_M  (HINF_CHIP_STATE_V << HINF_CHIP_STATE_S)
#define HINF_CHIP_STATE_V  0x000000FFU
#define HINF_CHIP_STATE_S  8
/** HINF_SDIO_RST : R/W; bitpos: [16]; default: 0;
 *  soft reset control for sdio module
 */
#define HINF_SDIO_RST    (BIT(16))
#define HINF_SDIO_RST_M  (HINF_SDIO_RST_V << HINF_SDIO_RST_S)
#define HINF_SDIO_RST_V  0x00000001U
#define HINF_SDIO_RST_S  16
/** HINF_SDIO_IOREADY0 : R/W; bitpos: [17]; default: 1;
 *  sdio io ready, high enable
 */
#define HINF_SDIO_IOREADY0    (BIT(17))
#define HINF_SDIO_IOREADY0_M  (HINF_SDIO_IOREADY0_V << HINF_SDIO_IOREADY0_S)
#define HINF_SDIO_IOREADY0_V  0x00000001U
#define HINF_SDIO_IOREADY0_S  17
/** HINF_SDIO_MEM_PD : R/W; bitpos: [18]; default: 0;
 *  sdio memory power down, high active
 */
#define HINF_SDIO_MEM_PD    (BIT(18))
#define HINF_SDIO_MEM_PD_M  (HINF_SDIO_MEM_PD_V << HINF_SDIO_MEM_PD_S)
#define HINF_SDIO_MEM_PD_V  0x00000001U
#define HINF_SDIO_MEM_PD_S  18
/** HINF_ESDIO_DATA1_INT_EN : R/W; bitpos: [19]; default: 0;
 *  enable sdio interrupt on data1 line
 */
#define HINF_ESDIO_DATA1_INT_EN    (BIT(19))
#define HINF_ESDIO_DATA1_INT_EN_M  (HINF_ESDIO_DATA1_INT_EN_V << HINF_ESDIO_DATA1_INT_EN_S)
#define HINF_ESDIO_DATA1_INT_EN_V  0x00000001U
#define HINF_ESDIO_DATA1_INT_EN_S  19
/** HINF_SDIO_SWITCH_VOLT_SW : R/W; bitpos: [20]; default: 0;
 *  control switch voltage change to 1.8V by software. 0:3.3V,1:1.8V
 */
#define HINF_SDIO_SWITCH_VOLT_SW    (BIT(20))
#define HINF_SDIO_SWITCH_VOLT_SW_M  (HINF_SDIO_SWITCH_VOLT_SW_V << HINF_SDIO_SWITCH_VOLT_SW_S)
#define HINF_SDIO_SWITCH_VOLT_SW_V  0x00000001U
#define HINF_SDIO_SWITCH_VOLT_SW_S  20
/** HINF_DDR50_BLK_LEN_FIX_EN : R/W; bitpos: [21]; default: 0;
 *  enable block length to be fixed to 512 bytes in ddr50 mode
 */
#define HINF_DDR50_BLK_LEN_FIX_EN    (BIT(21))
#define HINF_DDR50_BLK_LEN_FIX_EN_M  (HINF_DDR50_BLK_LEN_FIX_EN_V << HINF_DDR50_BLK_LEN_FIX_EN_S)
#define HINF_DDR50_BLK_LEN_FIX_EN_V  0x00000001U
#define HINF_DDR50_BLK_LEN_FIX_EN_S  21
/** HINF_CLK_EN : R/W; bitpos: [22]; default: 0;
 *  sdio apb clock for configuration force on control:0-gating,1-force on.
 */
#define HINF_CLK_EN    (BIT(22))
#define HINF_CLK_EN_M  (HINF_CLK_EN_V << HINF_CLK_EN_S)
#define HINF_CLK_EN_V  0x00000001U
#define HINF_CLK_EN_S  22
/** HINF_SDDR50 : R/W; bitpos: [23]; default: 1;
 *  configure if support sdr50 mode in cccr
 */
#define HINF_SDDR50    (BIT(23))
#define HINF_SDDR50_M  (HINF_SDDR50_V << HINF_SDDR50_S)
#define HINF_SDDR50_V  0x00000001U
#define HINF_SDDR50_S  23
/** HINF_SSDR104 : R/W; bitpos: [24]; default: 1;
 *  configure if support sdr104 mode in cccr
 */
#define HINF_SSDR104    (BIT(24))
#define HINF_SSDR104_M  (HINF_SSDR104_V << HINF_SSDR104_S)
#define HINF_SSDR104_V  0x00000001U
#define HINF_SSDR104_S  24
/** HINF_SSDR50 : R/W; bitpos: [25]; default: 1;
 *  configure if support ddr50 mode in cccr
 */
#define HINF_SSDR50    (BIT(25))
#define HINF_SSDR50_M  (HINF_SSDR50_V << HINF_SSDR50_S)
#define HINF_SSDR50_V  0x00000001U
#define HINF_SSDR50_S  25
/** HINF_SDTD : R/W; bitpos: [26]; default: 0;
 *  configure if support driver type D in cccr
 */
#define HINF_SDTD    (BIT(26))
#define HINF_SDTD_M  (HINF_SDTD_V << HINF_SDTD_S)
#define HINF_SDTD_V  0x00000001U
#define HINF_SDTD_S  26
/** HINF_SDTA : R/W; bitpos: [27]; default: 0;
 *  configure if support driver type A in cccr
 */
#define HINF_SDTA    (BIT(27))
#define HINF_SDTA_M  (HINF_SDTA_V << HINF_SDTA_S)
#define HINF_SDTA_V  0x00000001U
#define HINF_SDTA_S  27
/** HINF_SDTC : R/W; bitpos: [28]; default: 0;
 *  configure if support driver type C in cccr
 */
#define HINF_SDTC    (BIT(28))
#define HINF_SDTC_M  (HINF_SDTC_V << HINF_SDTC_S)
#define HINF_SDTC_V  0x00000001U
#define HINF_SDTC_S  28
/** HINF_SAI : R/W; bitpos: [29]; default: 1;
 *  configure if support asynchronous interrupt in cccr
 */
#define HINF_SAI    (BIT(29))
#define HINF_SAI_M  (HINF_SAI_V << HINF_SAI_S)
#define HINF_SAI_V  0x00000001U
#define HINF_SAI_S  29
/** HINF_SDIO_WAKEUP_CLR : WT; bitpos: [30]; default: 0;
 *  clear sdio_wake_up signal after the chip wakes up
 */
#define HINF_SDIO_WAKEUP_CLR    (BIT(30))
#define HINF_SDIO_WAKEUP_CLR_M  (HINF_SDIO_WAKEUP_CLR_V << HINF_SDIO_WAKEUP_CLR_S)
#define HINF_SDIO_WAKEUP_CLR_V  0x00000001U
#define HINF_SDIO_WAKEUP_CLR_S  30

/** HINF_CIS_CONF_W0_REG register
 *  SDIO cis configuration register
 */
#define HINF_CIS_CONF_W0_REG (DR_REG_HINF_BASE + 0x20)
/** HINF_CIS_CONF_W0 : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configure cis addr 39~36
 */
#define HINF_CIS_CONF_W0    0xFFFFFFFFU
#define HINF_CIS_CONF_W0_M  (HINF_CIS_CONF_W0_V << HINF_CIS_CONF_W0_S)
#define HINF_CIS_CONF_W0_V  0xFFFFFFFFU
#define HINF_CIS_CONF_W0_S  0

/** HINF_CIS_CONF_W1_REG register
 *  SDIO cis configuration register
 */
#define HINF_CIS_CONF_W1_REG (DR_REG_HINF_BASE + 0x24)
/** HINF_CIS_CONF_W1 : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configure cis addr 43~40
 */
#define HINF_CIS_CONF_W1    0xFFFFFFFFU
#define HINF_CIS_CONF_W1_M  (HINF_CIS_CONF_W1_V << HINF_CIS_CONF_W1_S)
#define HINF_CIS_CONF_W1_V  0xFFFFFFFFU
#define HINF_CIS_CONF_W1_S  0

/** HINF_CIS_CONF_W2_REG register
 *  SDIO cis configuration register
 */
#define HINF_CIS_CONF_W2_REG (DR_REG_HINF_BASE + 0x28)
/** HINF_CIS_CONF_W2 : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configure cis addr 47~44
 */
#define HINF_CIS_CONF_W2    0xFFFFFFFFU
#define HINF_CIS_CONF_W2_M  (HINF_CIS_CONF_W2_V << HINF_CIS_CONF_W2_S)
#define HINF_CIS_CONF_W2_V  0xFFFFFFFFU
#define HINF_CIS_CONF_W2_S  0

/** HINF_CIS_CONF_W3_REG register
 *  SDIO cis configuration register
 */
#define HINF_CIS_CONF_W3_REG (DR_REG_HINF_BASE + 0x2c)
/** HINF_CIS_CONF_W3 : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configure cis addr 51~48
 */
#define HINF_CIS_CONF_W3    0xFFFFFFFFU
#define HINF_CIS_CONF_W3_M  (HINF_CIS_CONF_W3_V << HINF_CIS_CONF_W3_S)
#define HINF_CIS_CONF_W3_V  0xFFFFFFFFU
#define HINF_CIS_CONF_W3_S  0

/** HINF_CIS_CONF_W4_REG register
 *  SDIO cis configuration register
 */
#define HINF_CIS_CONF_W4_REG (DR_REG_HINF_BASE + 0x30)
/** HINF_CIS_CONF_W4 : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configure cis addr 55~52
 */
#define HINF_CIS_CONF_W4    0xFFFFFFFFU
#define HINF_CIS_CONF_W4_M  (HINF_CIS_CONF_W4_V << HINF_CIS_CONF_W4_S)
#define HINF_CIS_CONF_W4_V  0xFFFFFFFFU
#define HINF_CIS_CONF_W4_S  0

/** HINF_CIS_CONF_W5_REG register
 *  SDIO cis configuration register
 */
#define HINF_CIS_CONF_W5_REG (DR_REG_HINF_BASE + 0x34)
/** HINF_CIS_CONF_W5 : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configure cis addr 59~56
 */
#define HINF_CIS_CONF_W5    0xFFFFFFFFU
#define HINF_CIS_CONF_W5_M  (HINF_CIS_CONF_W5_V << HINF_CIS_CONF_W5_S)
#define HINF_CIS_CONF_W5_V  0xFFFFFFFFU
#define HINF_CIS_CONF_W5_S  0

/** HINF_CIS_CONF_W6_REG register
 *  SDIO cis configuration register
 */
#define HINF_CIS_CONF_W6_REG (DR_REG_HINF_BASE + 0x38)
/** HINF_CIS_CONF_W6 : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configure cis addr 63~60
 */
#define HINF_CIS_CONF_W6    0xFFFFFFFFU
#define HINF_CIS_CONF_W6_M  (HINF_CIS_CONF_W6_V << HINF_CIS_CONF_W6_S)
#define HINF_CIS_CONF_W6_V  0xFFFFFFFFU
#define HINF_CIS_CONF_W6_S  0

