espressif/esp-idf/components/soc/esp32c6/include/soc/hinf_reg.h
/** HINF_SDIO_SLAVE_LDO_CONF_REG register
 *  sdio slave ldo control register
 */
#define HINF_SDIO_SLAVE_LDO_CONF_REG (DR_REG_HINF_BASE + 0xb0)
/** HINF_LDO_READY_CTL_IN_EN : R/W; bitpos: [0]; default: 0;
 *  control ldo ready signal by sdio slave itself
 */
#define HINF_LDO_READY_CTL_IN_EN    (BIT(0))
#define HINF_LDO_READY_CTL_IN_EN_M  (HINF_LDO_READY_CTL_IN_EN_V << HINF_LDO_READY_CTL_IN_EN_S)
#define HINF_LDO_READY_CTL_IN_EN_V  0x00000001U
#define HINF_LDO_READY_CTL_IN_EN_S  0
/** HINF_LDO_READY_THRES : R/W; bitpos: [5:1]; default: 10;
 *  configure ldo ready counting threshold value, the actual counting target is
 *  2^(ldo_ready_thres)-1
 */
#define HINF_LDO_READY_THRES    0x0000001FU
#define HINF_LDO_READY_THRES_M  (HINF_LDO_READY_THRES_V << HINF_LDO_READY_THRES_S)
#define HINF_LDO_READY_THRES_V  0x0000001FU
#define HINF_LDO_READY_THRES_S  1
/** HINF_LDO_READY_IGNORE_EN : R/W; bitpos: [6]; default: 0;
 *  ignore ldo ready signal
 */
#define HINF_LDO_READY_IGNORE_EN    (BIT(6))
#define HINF_LDO_READY_IGNORE_EN_M  (HINF_LDO_READY_IGNORE_EN_V << HINF_LDO_READY_IGNORE_EN_S)
#define HINF_LDO_READY_IGNORE_EN_V  0x00000001U
#define HINF_LDO_READY_IGNORE_EN_S  6

/** HINF_SDIO_DATE_REG register
 *  ******* Description ***********
 */
#define HINF_SDIO_DATE_REG (DR_REG_HINF_BASE + 0xfc)
/** HINF_SDIO_DATE : R/W; bitpos: [31:0]; default: 35664208;
 *  sdio version date.
 */
#define HINF_SDIO_DATE    0xFFFFFFFFU
#define HINF_SDIO_DATE_M  (HINF_SDIO_DATE_V << HINF_SDIO_DATE_S)
#define HINF_SDIO_DATE_V  0xFFFFFFFFU
#define HINF_SDIO_DATE_S  0

#ifdef __cplusplus
}
#endif
